const adjectives: string[] = [
    "우아한", "귀여운", "멋진", "용감한", "지혜로운", "행복한", "재밌는", "친절한", "사랑스러운", "활기찬",
    "기쁜", "상냥한", "명랑한", "강한", "창의적인", "독특한", "차분한", "영리한", "매력적인", "신비로운",
    "똑똑한", "예쁜", "깨끗한", "정직한", "순수한", "활발한", "친근한", "자유로운", "화려한", "다정한"
];
  
const nouns: string[] = [
    "사자", "호랑이", "곰", "상어", "독수리", "여우", "늑대", "판다", "매", "부엉이", "왕자", "공주",
    "전사", "농부", "해적", "기사", "마법사","탐험가","햄스터","다람쥐","톰", "라이언", "치즈", "나무", 
    "포레스트", "하트", "스타","케이크","커피","복숭아","키위","향수","외계인","조종사","바구니","햄버거",
    "콜라", "오타쿠","뽀빠이","린","다자이","류노스케","앙리","시즈오",
];

export const getNickname = (): string => {
    const random_a = adjectives[Math.floor(Math.random() * adjectives.length)];
    const random_n = nouns[Math.floor(Math.random() * nouns.length)];
    return `${random_a} ${random_n}`
}